{
  "ir_version": "0.1.0",
  "request_id": "anthropic_messages_error_fixture",
  "provider": {
    "id": "anthropic",
    "host": "api.anthropic.com",
    "confidence": 1.0
  },
  "operation": "messages.create",
  "model": "claude-sonnet-4-5",
  "instructions": [],
  "messages": [
    {
      "id": "message_0",
      "role": "user",
      "parts": [
        {
          "kind": "text",
          "id": "message_0_part_0",
          "text": "Return a synthetic overload error.",
          "evidence": {
            "level": "observed",
            "source": {
              "kind": "json_pointer",
              "pointer": "/messages/0/content"
            },
            "confidence": 1.0
          }
        }
      ],
      "evidence": {
        "level": "observed",
        "source": {
          "kind": "json_pointer",
          "pointer": "/messages/0"
        },
        "confidence": 1.0
      }
    }
  ],
  "context": [],
  "tools": [],
  "generation": {
    "max_output_tokens": 128
  },
  "vendor": {
    "stream": true
  },
  "response": {
    "role": "assistant",
    "parts": [],
    "error": {
      "message": "Synthetic overload",
      "type": "overloaded_error"
    },
    "events": [
      {
        "index": 0,
        "kind": "error",
        "evidence": {
          "level": "observed",
          "source": {
            "kind": "stream_event",
            "index": 0
          },
          "confidence": 1.0
        }
      }
    ],
    "evidence": {
      "level": "observed",
      "source": {
        "kind": "stream_event",
        "index": 0
      },
      "confidence": 1.0
    }
  },
  "completeness": {
    "request_body": "complete",
    "response_body": "complete"
  }
}
